Pandas data reshaping transform the structure of a table or vector to make it suitable for further data analysis. Pandas use multiple methods to reshape the dataframe and series.

Reshaping :

Stack

In [2]:
import numpy as np
import pandas as pd

In [3]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two']]))

In [4]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(6, 2), index=index, columns=['M', 'N'])
df2 = df[:4]
df2

                     M         N
first second
bar   one     1.347718 -0.240241
      two    -0.364443  0.052792
baz   one     0.534508 -0.945457
      two     0.018393 -0.709800

In [5]:
#The stack() method “compresses” a level in the DataFrame’s columns.
stacked=df2.stack()

In [6]:
stacked

first  second
bar    one     M    1.347718
               N   -0.240241
       two     M   -0.364443
               N    0.052792
baz    one     M    0.534508
               N   -0.945457
       two     M    0.018393
               N   -0.709800
dtype: float64

In [7]:
stacked.unstack()

                     M         N
first second
bar   one     1.347718 -0.240241
      two    -0.364443  0.052792
baz   one     0.534508 -0.945457
      two     0.018393 -0.709800

In [8]:
stacked.unstack(1)

second        one       two
first
bar   M  1.347718 -0.364443
      N -0.240241  0.052792
baz   M  0.534508  0.018393
      N -0.945457 -0.709800

In [9]:
stacked.unstack(0)

first          bar       baz
second
one    M  1.347718  0.534508
       N -0.240241 -0.945457
two    M -0.364443  0.018393
       N  0.052792 -0.709800

In [11]:
#Pivot tables
df = pd.DataFrame({'M': ['one', 'one', 'two', 'three'] * 2,
                       'N': ['A', 'B'] * 4,
                       'O': ['foo', 'foo', 'bar', 'bar'] * 2,
                       'P': np.random.randn(8),
                       'Q': np.random.randn(8)})

In [12]:
df

       M  N    O         P         Q
0    one  A  foo  1.519306 -1.293834
1    one  B  foo -2.650219  0.480373
2    two  A  bar  0.213212  0.524176
3  three  B  bar -0.189722  1.485780
4    one  A  foo -0.760599  1.370146
5    one  B  foo  0.399247  0.103404
6    two  A  bar  0.462833  1.183758
7  three  B  bar  0.056264 -2.388817

In [14]:
#You can produce pivot tables from this data very easily:
pd.pivot_table(df,values='P',index=['M','N'],columns=['O'])

O             bar       foo
M     N
one   A       NaN  0.379354
      B       NaN -1.125486
three B -0.066729       NaN
two   A  0.338022       NaN